const films = [
  {
    name: "Сонік в кіно",
    poster: "assets/sonic.jpg",
    description: "Одна далека та не схожа на Землю планета в небезпеці. Щоб її врятувати неймовірно швидкий, веселий і по-справжньому відважний їжак Сонік телепортувався до нашого рідного дому, а саме до США. Стрибок напруги після того, як енергійний їжак приземлився у нас, привів до зникнення електрики на всьому Північно-Західному узбережжі країни, що не пройшло повз увагу Пентагону. За Соніком уже почала полювання влада, і головний мисливець – доктор Роботник, який хоче захопити весь світ. Але першою людиною, що зустрілася їжаку, був Том Вачовськи. Це звичайний хлопець, який вирішив допомогти Соніку та не дати Роботнику здійснити свій жахливий план.",
    times: [
      "12:00",
      "14:00",
      "15:00",
      "17:30",
      "19:00"
    ],
    dates: [ 
      "2020-02-17",
      "2020-02-18",
      "2020-02-19",
      "2020-02-20",
      "2020-02-21"
    ],
    seats: [
      // a - available
      // t - taken
      // u - unavailable
      ["u", "a", "a", "a", "a", "a", "a", "a", "u", "a", "a"],
      ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
      ["a", "u", "a", "a", "a", "a", "u", "a", "a", "a", "a"],
      ["a", "a", "a", "a", "u", "a", "a", "a", "a", "a", "a"],
      ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
      ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
      ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
      ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
      ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"]
    ]
  },
  {
    id: 1,
    name: "Сонік в кіно",
    poster: "assets/sonic.jpg",
    description: "Одна далека та не схожа на Землю планета в небезпеці. Щоб її врятувати неймовірно швидкий, веселий і по-справжньому відважний їжак Сонік телепортувався до нашого рідного дому, а саме до США. Стрибок напруги після того, як енергійний їжак приземлився у нас, привів до зникнення електрики на всьому Північно-Західному узбережжі країни, що не пройшло повз увагу Пентагону. За Соніком уже почала полювання влада, і головний мисливець – доктор Роботник, який хоче захопити весь світ. Але першою людиною, що зустрілася їжаку, був Том Вачовськи. Це звичайний хлопець, який вирішив допомогти Соніку та не дати Роботнику здійснити свій жахливий план.",
    dates: [
      {
        date: "2020-02-17",
        sessions: [
          {
            time: "12:00",
            seats: [
              ["u", "a", "a", "a", "a", "a", "a", "a", "u", "a", "a"],
              ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
              ["a", "u", "a", "a", "a", "a", "u", "a", "a", "a", "a"],
              ["a", "a", "a", "a", "u", "a", "a", "a", "a", "a", "a"],
              ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
              ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
              ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
              ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"],
              ["a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a"]
            ]
          },
          {
            
          }
        ]
      }
    ]
  }
]

export default films
